stm32mpu-oem/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257CXX_VALIDX/stm32mp257cxx_validx.c
/**
  ******************************************************************************
  * @file    stm32mp257cxx_validx.c
  * @author  MCD Application Team
  * @brief   This file provides a set of firmware functions to manage
  *          LEDs
  *          push-buttons
  *          COM ports
  *          available on STM32MP257CXX-VALIDX board(MB170/4,5,6) from STMicroelectronics.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp257cxx_validx.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32MP257CXX_VALIDX
  * @{
  */

/** @defgroup STM32MP257CXX_VALIDX_LOW_LEVEL LOW LEVEL
  * @{
  */

/** @defgroup STM32MP257CXX_VALIDX_LOW_LEVEL_Private_TypesDefinitions  Private Types Definitions
  * @{
  */
typedef void (* BSP_EXTI_LineCallback) (void);
/**
  * @}
  */

/** @defgroup STM32MP257CXX_VALIDX_LOW_LEVEL_Private_FunctionPrototypes  Private Function Prototypes
  * @{
  */
#if ! defined (USE_STM32MP257CXX_UNIBOARD)
#if defined (CORE_CA35) || defined (CORE_CM33)
static void BUTTON_WAKEUP_EXTI_Callback(void);
#endif /* CORE_CA35 || CORE_CM33 */
#endif /* ! USE_STM32MP257CXX_UNIBOARD */
#if (USE_BSP_COM_FEATURE > 0)
static void USART_MspInit(UART_HandleTypeDef *huart);
static void USART_MspDeInit(UART_HandleTypeDef *huart);
#endif
/**
  * @}
  */

/** @defgroup STM32MP257CXX_VALIDX_LOW_LEVEL_Exported_Variables Exported Variables
  * @{
  */
EXTI_HandleTypeDef hpb_exti[BUTTONn];
#if (USE_BSP_COM_FEATURE > 0)
UART_HandleTypeDef hcom_uart[COMn];
USART_TypeDef* COM_USART[COMn] =
#if defined (USE_STM32MP257CXX_UNIBOARD)
                                 {COM_COMMON_UART, COM_COMMON_UART, COM_COMMON_UART};
#else /* USE_STM32MP257CXX_UNIBOARD */
#if defined (CORE_CA35) || defined (CORE_CM33)
                                 {COM_CA35_UART, COM_CM33_UART, COM_CM0PLUS_UART};
#elif defined (CORE_CM0PLUS) /* Core_M0Plus uses only COM_CM0PLUS */
                                 {0, 0, COM_CM0PLUS_UART};
#endif /* CORE_<...> */
#endif /* USE_STM32MP257CXX_UNIBOARD */

#endif
/**
  * @}
  */

/** @defgroup STM32MP257CXX_VALIDX_LOW_LEVEL_Private_Variables Private Variables
  * @{
  */
#if ! defined (USE_STM32MP257CXX_UNIBOARD)
#if defined (CORE_CA35) || defined (CORE_CM33)
static GPIO_TypeDef* LED_PORT[LEDn] = { LED1_GPIO_PORT,
                                        LED2_GPIO_PORT,
                                        LED3_GPIO_PORT,
                                        LED4_GPIO_PORT};

static const uint32_t LED_PIN[LEDn] = { LED1_PIN,
                                        LED2_PIN,
                                        LED3_PIN,
                                        LED4_PIN};

static const GPIO_PinState GPIO_LED_OFF[LEDn] = { GPIO_PIN_SET,
                                                  GPIO_PIN_RESET,
                                                  GPIO_PIN_RESET,
                                                  GPIO_PIN_RESET};

static const GPIO_PinState GPIO_LED_ON[LEDn] = { GPIO_PIN_RESET,
                                                 GPIO_PIN_SET,
                                                 GPIO_PIN_SET,
                                                 GPIO_PIN_SET};


static GPIO_TypeDef* BUTTON_PORT[BUTTONn] = {BUTTON_WAKEUP_GPIO_PORT};
static const uint16_t BUTTON_PIN[BUTTONn] = {BUTTON_WAKEUP_PIN};
static const IRQn_Type BUTTON_IRQn[BUTTONn] = {BUTTON_WAKEUP_EXTI_IRQn};

#elif defined (CORE_CM0PLUS)
#warning "Core M0 can't manage LED in Validx Board"
#endif /* CORE_CA35 || CORE_CM33*/
#endif /* ! USE_STM32MP257CXX_UNIBOARD */

#if (USE_COM_LOG > 0)
/* define default active port to port dedicated to current Core
 * This is important for Validation applications which are not explicitly setting active log port */
static COM_TypeDef COM_ActiveLogPort = COM1;
#endif
#if (USE_BSP_COM_FEATURE > 0)
 #if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  static uint32_t IsComMspCbValid[COMn] = {0};
 #endif
#endif

/**
  * @}
  */

/** @defgroup STM32MP257CXX_VALIDX_LOW_LEVEL_Exported_Functions Exported Functions
  * @{
  */

/**
  * @brief  This method returns the STM32MP257CXX VALIDX BSP Driver revision
  * @retval version: 0xXYZR (8bits for each decimal, R for RC)
  */
int32_t BSP_GetVersion(void)
{
  return (int32_t)STM32MP257CXX_VALIDX_BSP_VERSION;
}

/**
  * @brief  This method returns the board name
  * @retval pointer to the board name string
  */
const uint8_t* BSP_GetBoardName(void)
{
  return (uint8_t*)STM32MP257CXX_VALIDX_BSP_BOARD_NAME;
}

/**
  * @brief  This method returns the board ID
  * @retval pointer to the board name string
  */
const uint8_t* BSP_GetBoardID(void)
{
  return (uint8_t*)STM32MP257CXX_VALIDX_BSP_BOARD_ID;
}

#if ! defined (USE_STM32MP257CXX_UNIBOARD)
#if defined (CORE_CA35) || defined (CORE_CM33)
/**
  * @brief  Configures LED on GPIO.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t BSP_LED_Init(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  GPIO_InitTypeDef  GPIO_InitStruct;

  /* Enable the GPIO_LED clock */
  if (Led == LED1)
  {
    LED1_GPIO_CLK_ENABLE();
  }
  else if (Led == LED2)
  {
    LED2_GPIO_CLK_ENABLE();
  }
  else if (Led == LED3)
  {
    LED3_GPIO_CLK_ENABLE();
  }
  else if (Led == LED4)
  {
    LED4_GPIO_CLK_ENABLE();
  }

  /* Configure the GPIO_LED pin */
  GPIO_InitStruct.Pin = LED_PIN[Led];
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

