stm32mpu-oem/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257CXX_VALIDX/stm32mp257cxx_validx.c
    if(HAL_UART_DeInit(&hcom_uart[COM]) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return ret;
}

/**
  * @brief  Configures COM<n> port.
  * @param  huart USART handle
  * @param  COM_Init Pointer to a UART_HandleTypeDef structure that contains the
  *                  configuration information for the specified USART peripheral.
  * @retval HAL error code
  */
__weak HAL_StatusTypeDef MX_USART_Init(UART_HandleTypeDef *huart, MX_UART_InitTypeDef *COM_Init)
{
  HAL_StatusTypeDef ErrorCode;

  /* USART configuration */
  huart->Init.BaudRate     = (uint32_t)COM_Init->BaudRate;
#if defined(USE_STM32MP257CXX_UNIBOARD)
  /* DON'T use UART RX on UNIBOARD because this config is dedicated for Autoboard
   * and we try to keep as many IOs available as possible
   */
  huart->Init.Mode         = UART_MODE_TX;
#else /* USE_STM32MP257CXX_UNIBOARD */
  huart->Init.Mode         = UART_MODE_TX_RX;
#endif /* USE_STM32MP257CXX_UNIBOARD */
  huart->Init.Parity       = (uint32_t)COM_Init->Parity;
  huart->Init.WordLength   = (uint32_t)COM_Init->WordLength;
  huart->Init.StopBits     = (uint32_t)COM_Init->StopBits;
  huart->Init.HwFlowCtl    = (uint32_t)COM_Init->HwFlowCtl;
  huart->Init.OverSampling = UART_OVERSAMPLING_8;
#if !defined (CORE_CM0PLUS)
  ErrorCode = HAL_UART_Init(huart);
#else
  /* Initialize the number of data to process during RX/TX ISR execution */
  huart->NbTxDataToProcess = 1;
  huart->NbRxDataToProcess = 1;
  /* Initialize the UART State */
  huart->gState = HAL_UART_STATE_READY;
  huart->RxState = HAL_UART_STATE_READY;
  ErrorCode = HAL_OK;
#endif /* !defined (CORE_CM0PLUS) */
  return ErrorCode;
}

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
/**
  * @brief Register Default COM Msp Callbacks
  * @param  COM COM port to be configured.
  * @retval BSP status
  */
int32_t BSP_COM_RegisterDefaultMspCallbacks(COM_TypeDef COM)
{
  int32_t ret = BSP_ERROR_NONE;

  if(COM >= COMn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_UART_RESET_HANDLE_STATE(&hcom_uart[COM]);

    /* Register default MspInit/MspDeInit Callback */
    if(HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPINIT_CB_ID, USART_MspInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if(HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPDEINIT_CB_ID, USART_MspDeInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsComMspCbValid[COM] = 1U;
    }
  }

  /* BSP status */
  return ret;
}

/**
  * @brief  Register COM<n> Msp Callback registering
  * @param  COM COM port to be configured.
  * @param  Callbacks     pointer to COM MspInit/MspDeInit callback functions
  * @retval BSP status
  */
int32_t BSP_COM_RegisterMspCallbacks(COM_TypeDef COM, BSP_COM_Cb_t *Callback)
{
  int32_t ret = BSP_ERROR_NONE;

  if(COM >= COMn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_UART_RESET_HANDLE_STATE(&hcom_uart[COM]);

    /* Register MspInit/MspDeInit Callbacks */
    if(HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPINIT_CB_ID, Callback->pMspInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if(HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPDEINIT_CB_ID, Callback->pMspDeInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsComMspCbValid[COM] = 1U;
    }
  }

  /* BSP status */
  return ret;
}
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */

#if (USE_COM_LOG > 0)
/**
  * @brief  Select the active COM port.
  * @param  COM COM port to be activated.
  *          This parameter can be COM1, COM2, COM3
  * @retval BSP status
  */
int32_t BSP_COM_SelectLogPort(COM_TypeDef COM)
{
  if(COM_ActiveLogPort != COM)
  {
    COM_ActiveLogPort = COM;
  }
  return BSP_ERROR_NONE;
}

#ifdef __GNUC__
int __io_putchar (int ch)
#else
int fputc (int ch, FILE *f)
#endif /* __GNUC__ */
{
  (void)HAL_UART_Transmit (&hcom_uart[COM_ActiveLogPort], (uint8_t *) &ch, 1, COM_POLL_TIMEOUT);
  return ch;
}

#ifdef __GNUC__
int __io_getchar(void)
{
  uint8_t ch = 0;
    HAL_UART_Receive(&hcom_uart[COM_ActiveLogPort], (uint8_t *)&ch, 1, COM1_RX_TIMEOUT);
    return ch;
}
#endif /* __GNUC__ */
#endif /* USE_COM_LOG */
#endif /* USE_BSP_COM_FEATURE */

/** @defgroup STM32MP257CXX_VALIDX_LOW_LEVEL_Private_Functions Private Functions
  * @{
  */

#if (USE_BSP_COM_FEATURE > 0)
/**
  * @brief  Initializes UART MSP.
  * @param  huart UART handle
  * @retval None
  */
static void USART_MspInit(UART_HandleTypeDef *huart)
{
  GPIO_InitTypeDef gpio_init_structure;

  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Pull = GPIO_PULLUP;

#if defined (CORE_CA35) || defined (CORE_CM33)
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

#if defined(USE_STM32MP257CXX_UNIBOARD)
  if (huart->Instance == COM_COMMON_UART)
  {
  /* USART5 clock config */
    PeriphClkInit.XBAR_Channel = RCC_PERIPHCLK_UART3_5;

    /* Enable USART and GPIOs clocks */
    COM_COMMON_CLK_ENABLE();
    COM_COMMON_TX_GPIO_CLK_ENABLE();

    /* Configure USART Tx as alternate function */
    gpio_init_structure.Pin = COM_COMMON_TX_PIN;
    gpio_init_structure.Alternate = COM_COMMON_TX_AF;
    HAL_GPIO_Init(COM_COMMON_TX_GPIO_PORT, &gpio_init_structure);

#if 0
    /* DON'T use UART RX on UNIBOARD because this config is dedicated for Autoboard
     * and we try to keep as many IOs available as possible
     */
     COM_COMMON_RX_GPIO_CLK_ENABLE();
    /* Configure USART Rx as alternate function */
    gpio_init_structure.Pin = COM_COMMON_RX_PIN;
    gpio_init_structure.Alternate = COM_COMMON_RX_AF;
    HAL_GPIO_Init(COM_COMMON_RX_GPIO_PORT, &gpio_init_structure);
#endif /* 0 */
  }
#else /* USE_STM32MP257CXX_UNIBOARD */
  if (huart->Instance == COM_CA35_UART)
  {
    /* USART2 clock config */
    PeriphClkInit.XBAR_Channel = RCC_PERIPHCLK_UART2_4;

    /* Enable USART clock */
    COM_CA35_TX_GPIO_CLK_ENABLE();
    COM_CA35_RX_GPIO_CLK_ENABLE();
    COM_CA35_CLK_ENABLE();
    /* Configure USART Tx as alternate function */
    gpio_init_structure.Pin = COM_CA35_TX_PIN;
    gpio_init_structure.Alternate = COM_CA35_TX_AF;
    HAL_GPIO_Init(COM_CA35_TX_GPIO_PORT, &gpio_init_structure);

