stm32mpu-oem/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257CXX_VALIDX/stm32mp257cxx_validx.c
    /* Configure USART Rx as alternate function */
    gpio_init_structure.Pin = COM_CA35_RX_PIN;
    gpio_init_structure.Alternate = COM_CA35_RX_AF;
    HAL_GPIO_Init(COM_CA35_RX_GPIO_PORT, &gpio_init_structure);
  }
  else if (huart->Instance == COM_CM33_UART)
  {
  /* USART5 or UART8 clock config */
#if defined(USE_STM32MP257CXX_VALID1) || defined(USE_STM32MP257CXX_VALID3)
    PeriphClkInit.XBAR_Channel = RCC_PERIPHCLK_UART3_5;
#else
    PeriphClkInit.XBAR_Channel = RCC_PERIPHCLK_UART7_8;
#endif /* USE_STM32MP257CXX_VALID1 & 3*/

    /* Enable USART clock */
    COM_CM33_TX_GPIO_CLK_ENABLE();
    COM_CM33_RX_GPIO_CLK_ENABLE();
    COM_CM33_CLK_ENABLE();

    /* Configure USART Tx as alternate function */
    gpio_init_structure.Pin = COM_CM33_TX_PIN;
    gpio_init_structure.Alternate = COM_CM33_TX_AF;
    HAL_GPIO_Init(COM_CM33_TX_GPIO_PORT, &gpio_init_structure);

    /* Configure USART Rx as alternate function */
    gpio_init_structure.Pin = COM_CM33_RX_PIN;
    gpio_init_structure.Alternate = COM_CM33_RX_AF;
    HAL_GPIO_Init(COM_CM33_RX_GPIO_PORT, &gpio_init_structure);
  }
  else if (huart->Instance == COM_CM0PLUS_UART)
  {
    /* LPUART clock config */
    PeriphClkInit.XBAR_Channel = RCC_PERIPHCLK_LPUART1;

    /* Enable Backup domain access */
    HAL_PWR_EnableBkUpD3Access();

    /* Enable USART clock */
    COM_CM0PLUS_TX_GPIO_CLK_ENABLE();
    COM_CM0PLUS_RX_GPIO_CLK_ENABLE();
    COM_CM0PLUS_CLK_ENABLE();

    /* Configure USART Tx as alternate function */
    gpio_init_structure.Pin = COM_CM0PLUS_TX_PIN;
    gpio_init_structure.Alternate = COM_CM0PLUS_TX_AF;
    HAL_GPIO_Init(COM_CM0PLUS_TX_GPIO_PORT, &gpio_init_structure);

    /* Configure USART Rx as alternate function */
    gpio_init_structure.Pin = COM_CM0PLUS_RX_PIN;
    gpio_init_structure.Alternate = COM_CM0PLUS_RX_AF;
    HAL_GPIO_Init(COM_CM0PLUS_RX_GPIO_PORT, &gpio_init_structure);
  }
#endif /* USE_STM32MP257CXX_UNIBOARD */

  /* Start HSE Oscillator to use it for UART source */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    while (1);
  }

  /* Set HSE as source clock for UART COM */
  PeriphClkInit.XBAR_ClkSrc = RCC_XBAR_CLKSRC_HSE;
  PeriphClkInit.Div = 1;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    while (1);
  }

#elif defined(CORE_CM0PLUS)
  HAL_PWR_EnableBkUpAccess();
  /* Configure USART Tx as alternate function */
  gpio_init_structure.Pin = COM_CM0PLUS_TX_PIN;
  gpio_init_structure.Alternate = COM_CM0PLUS_TX_AF;
  HAL_GPIO_Init(COM_CM0PLUS_TX_GPIO_PORT, &gpio_init_structure);

  /* Configure USART Rx as alternate function */
  gpio_init_structure.Pin = COM_CM0PLUS_RX_PIN;
  gpio_init_structure.Alternate = COM_CM0PLUS_RX_AF;
  HAL_GPIO_Init(COM_CM0PLUS_RX_GPIO_PORT, &gpio_init_structure);
#warning "Core M0 can't manage RCC clock config"
#endif /* CORE_CA35 || CORE_CM33 */
}

/**
  * @brief  Initialize USART6 Msp part
  * @param  huart UART handle
  * @retval None
  */
static void USART_MspDeInit(UART_HandleTypeDef *huart)
{
  GPIO_InitTypeDef          gpio_init_structure;

#if defined (CORE_CA35) || defined (CORE_CM33)
#if defined(USE_STM32MP257CXX_UNIBOARD)
  if (huart->Instance == COM_COMMON_UART)
  {
    /* COM GPIO pin configuration */
    gpio_init_structure.Pin  = COM_COMMON_TX_PIN;
    HAL_GPIO_DeInit(COM_COMMON_TX_GPIO_PORT, gpio_init_structure.Pin);

#if 0
    /* DON'T use UART RX on UNIBOARD because this config is dedicated for Autoboard
     * and we try to keep as many IOs available as possible
     */
    gpio_init_structure.Pin  = COM_COMMON_RX_PIN;
    HAL_GPIO_DeInit(COM_COMMON_RX_GPIO_PORT, gpio_init_structure.Pin);
#endif /* 0 */
    /* Disable USART clock */
    COM_COMMON_CLK_DISABLE();
  }
#else /* USE_STM32MP257CXX_UNIBOARD */
  if (huart->Instance == COM_CA35_UART)
  {
    /* COM GPIO pin configuration */
    gpio_init_structure.Pin  = COM_CA35_TX_PIN;
    HAL_GPIO_DeInit(COM_CA35_TX_GPIO_PORT, gpio_init_structure.Pin);

    gpio_init_structure.Pin  = COM_CA35_RX_PIN;
    HAL_GPIO_DeInit(COM_CA35_RX_GPIO_PORT, gpio_init_structure.Pin);

    /* Disable USART clock */
    COM_CA35_CLK_DISABLE();
  }
  else if (huart->Instance == COM_CM33_UART)
  {
    /* COM GPIO pin configuration */
    gpio_init_structure.Pin  = COM_CM33_TX_PIN;
    HAL_GPIO_DeInit(COM_CM33_TX_GPIO_PORT, gpio_init_structure.Pin);

    gpio_init_structure.Pin  = COM_CM33_RX_PIN;
    HAL_GPIO_DeInit(COM_CM33_RX_GPIO_PORT, gpio_init_structure.Pin);

    /* Disable USART clock */
    COM_CM33_CLK_DISABLE();
  }
  else if (huart->Instance == COM_CM0PLUS_UART)
  {
    /* COM GPIO pin configuration */
    gpio_init_structure.Pin  = COM_CM0PLUS_TX_PIN;
    HAL_GPIO_DeInit(COM_CM0PLUS_TX_GPIO_PORT, gpio_init_structure.Pin);

    gpio_init_structure.Pin  = COM_CM0PLUS_RX_PIN;
    HAL_GPIO_DeInit(COM_CM0PLUS_RX_GPIO_PORT, gpio_init_structure.Pin);

    /* Disable USART clock */
    COM_CM0PLUS_CLK_DISABLE();
  }
#endif /* USE_STM32MP257CXX_UNIBOARD */

#elif defined(CORE_CM0PLUS)
  /* COM GPIO pin configuration */
  gpio_init_structure.Pin  = COM_CM0PLUS_TX_PIN;
  HAL_GPIO_DeInit(COM_CM0PLUS_TX_GPIO_PORT, gpio_init_structure.Pin);

  gpio_init_structure.Pin  = COM_CM0PLUS_RX_PIN;
  HAL_GPIO_DeInit(COM_CM0PLUS_RX_GPIO_PORT, gpio_init_structure.Pin);
#warning "Core M0 can't manage RCC clock config"
#endif /* CORE_CA35 || CORE_CM33 */
}
#endif /* USE_BSP_COM_FEATURE */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
